using System.ComponentModel;

namespace ToursWebAppEXAMProject.EnumsDictionaries
{
	public enum CountriesListEnum
	{
		Австрия,
		Австралия,
		Азербайджан,
		Албания,
		Андорра,
		Армения,
		Афганистан,
		Бангладеш,
		Бахрейн,
		Белоруссия,
		Бельгия,
		Болгария,
		[Description("Босния и Герцеговина")]
		Босния_и_Герцеговина,
		Бруней,
		Бутан,
		Ватикан,
		Великобритания,
		Венгрия,
		[Description("Восточный Тимор")]
		Восточный_Тимор,
		Вьетнам,
		Германия,
		Греция,
		Грузия,
		Дания,
		Израиль,
		Индия,
		Индонезия,
		Иордания,
		Ирак,
		Иран,
		Ирландия,
		Исландия,
		Испания,
		Италия,
		Йемен,
		Казахстан,
		Камбоджа,
		Катар,
		Кипр,
		Киргизия,
		Тайвань,
		КНДР,
		Китай,
		Кувейт,
		Лаос,
		Латвия,
		Ливан,
		Литва,
		Лихтенштейн,
		Люксембург,
		Малайзия,
		Мальдивы,
		Мальта,
		Молдавия,
		Монако,
		Монголия,
		Мьянма,
		Непал,
		Нидерланды,
		Норвегия,
		ОАЭ,
		Оман,
		Пакистан,
		Польша,
		Португалия,
		Россия,
		Румыния,
		[Description("Сан Марино")]
		Сан_Марино,
		[Description("Саудовская Аравия")]
		Саудовская_Аравия,
		[Description("Северная Македония")]
		Северная_Македония,
		Сербия,
		Сингапур,
		Сирия,
		Словакия,
		Словения,
		Таджикистан,
		Таиланд,
		Туркмения,
		Турция,
		Узбекистан,
		Украина,
		Филиппины,
		Финляндия,
		Франция,
		Хорватия,
		Черногория,
		Чехия,
		Швейцария,
		Швеция,
		[Description("Шри-Ланка")]
		Шри_Ланка,
		Эстония,
		[Description("Южная Корея")]
		Южная_Корея,
		Япония

		/*

		АФРИКА

		Алжир,
		Ангола,
		Бенин,
		Ботсвана,
		Буркина_Фасо,
		Бурунди,
		Габон,
		Гамбия,
		Гана,
		Гвинея,
		Гвинея_Бисау,
		Джибути,
		ДР_Конго,
		Египет,
		Замбия,
		Зимбабве,
		Кабо-Верде,
		Камерун,
		Кения,
		Коморы,
		Кот_д’Ивуар,
		Лесото,
		Либерия,
		Ливия,
		Маврикий,
		Мавритания,
		Мадагаскар,
		Малави,
		Мали,
		Марокко,
		Мозамбик,
		Намибия,
		Нигер,
		Нигерия,
		Республика_Конго,
		Руанда,
		Сан_Томе_и_Принсипи,
		Свазиленд,
		Сейшельские_Острова,
		Сенегал,
		Сомали,
		Судан,
		Сьерра_Леоне,
		Танзания,
		Того,
		Тунис,
		Уганда,
		Центральноафриканская_Республика,
		Чад,
		Экваториальная_Гвинея,
		Эритрея,
		Эфиопия,
		ЮАР,
		Южный_Судан,



		АМЕРИКА

		Антигуа_и_Барбуда
		Аргентина
		Багамы
		Барбадос
		Белиз
		Боливия
		Бразилия
		Венесуэла
		Гаити
		Гайана
		Гватемала
		Гвиана
		Гондурас
		Гренада
		Доминика
		Доминиканская Республика
		Канада
		Колумбия
		Коста-Рика
		Куба
		Мексика
		Никарагуа
		Панама
		Парагвай
		Перу
		Сальвадор
		Сент_Винсент_и_Гренадины
		Сент_Китс_и_Невис
		Сент_Люсия
		Суринам
		США
		Тринидад_и_Тобаго
		Уругвай
		Чили
		Эквадор
		Ямайка



		АВСТРАЛИЯ И ОКЕАНИЯ

		Австралия
		Вануату
		Кирибати
		Маршалловы_Острова
		Микронезия
		Новая_Зеландия
		Палау
		Папуа_Новая_Гвинея
		Самоа
		Соломоновы_Острова
		Тонга
		Тувалу
		Фиджи
		*/
	}

}
